app/views/trainings/show.html.erb

SELECT "workshops".* FROM "workshops" INNER JOIN "training_workshops" ON "workshops"."id" = "training_workshops"."workshop_id" WHERE "training_workshops"."training_id" = $1  [["training_id", 3]]
SELECT COUNT(*) FROM "workshops" INNER JOIN "training_workshops" ON "workshops"."id" = "training_workshops"."workshop_id" WHERE "training_workshops"."training_id" = $1  [["training_id", 3]]
---
        <div>
          <% if @training.workshops.present? %>
            <p><%= "#{@training.workshops.count} Workshops" %></p>

SELECT COUNT(*) FROM "attendees" WHERE "attendees"."training_id" = $1  [["training_id", 1]]
---
            <% if ['Super Admin', 'HR'].include?(current_user.access_level) %>
              <p><%= "#{Attendee.where(training_id: @training.id).count}/#{@training.participant_number} seats reserved" %></p>

SELECT "attendees".* FROM "attendees" WHERE "attendees"."training_id" = $1 AND "attendees"."user_id" = $2 ORDER BY "attendees"."id" ASC LIMIT $3  [["training_id", 1], ["user_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "attendees" WHERE "attendees"."training_id" = $1 AND "attendees"."user_id" = $2 LIMIT $3  [["training_id", 1], ["user_id", 1], ["LIMIT", 1]]
---
        <div class="training-show-card-footer-buttons centered-item">
          <% if Attendee.where(training_id: @training.id, user_id: current_user.id).empty? %>

SELECT "attendees".* FROM "attendees" WHERE "attendees"."training_id" = $1 AND "attendees"."user_id" = $2 ORDER BY "attendees"."id" ASC LIMIT $3  [["training_id", 1], ["user_id", 1], ["LIMIT", 1]]
---
          <% else %>
            <%= link_to "Unregister", attendee_path(Attendee.where(training_id: @training.id, user_id: current_user.id).first), method: :post, class: 'btn btn-edit-red' %>

SELECT "training_workshops".* FROM "training_workshops" WHERE "training_workshops"."training_id" = $1 ORDER BY "training_workshops"."date" ASC  [["training_id", 1]]
---
      </div>
      <% @training.training_workshops.order(date: :asc).each do |training_workshop| %>

SELECT "training_workshops".* FROM "training_workshops" WHERE "training_workshops"."training_id" = $1  [["training_id", 1]]
---

<% @training.training_workshops.each do |training_workshop| %>