app/views/workshops/_create_workshop_mod_index.html.erb

SELECT "mods".* FROM "mods" INNER JOIN "workshop_mods" ON "mods"."id" = "workshop_mods"."mod_id" WHERE "workshop_mods"."workshop_id" = $1  [["workshop_id", 25]]
---
  <div id='allmods'>
    <%= @new_workshop.mods.each do |mod| %>

SELECT "mods".* FROM "mods" WHERE "mods"."company_id" = $1  [["company_id", 1]]
---
      <div id='checkbox3' style=" display:flex;justify-content:space-between;flex-direction:column;">
        <%= collection_check_boxes(:workshop, :mod_ids, Mod.where(company_id: current_user.company_id), :id, :title) do |b| %>