app/views/workshops/_created_workshop.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "workshop_categories" ON "categories"."id" = "workshop_categories"."category_id" WHERE "workshop_categories"."workshop_id" = $1  [["workshop_id", 7]]
SELECT "categories".* FROM "categories" WHERE "categories"."company_id" = $1  [["company_id", 1]]
---
  <%= f.input :title, input_html: {value: @new_workshop.title }%>
  <% checked = @new_workshop.categories.map(&:id) %>
  <%= f.input :categories, collection: Category.where(company_id:current_user.company_id), as: :check_boxes, checked: checked %>