app/views/workshops/_index.html.erb

SELECT "program_workshops".* FROM "program_workshops" WHERE "program_workshops"."training_program_id" = $1 ORDER BY "program_workshops"."position" ASC  [["training_program_id", 4]]
SELECT "program_workshops".* FROM "program_workshops" WHERE "program_workshops"."workshop_id" = $1 AND "program_workshops"."training_program_id" = $2 LIMIT $3  [["workshop_id", 2], ["training_program_id", 4], ["LIMIT", 1]]
---
<div class="row">
  <% @training_program.program_workshops.order(position: :asc).map(&:workshop).each do |workshop| %>
    <% program_workshop = ProgramWorkshop.find_by(workshop_id: workshop.id, training_program_id: @training_program.id) %>