app/views/workshops/_module_index.html.erb

<% if @workshop.mods.present? %>
  <% @workshop.workshop_mods.order(position: :asc).each do |workshop_mod| %>
---
SELECT "mods".* FROM "mods" INNER JOIN "workshop_mods" ON "mods"."id" = "workshop_mods"."mod_id" WHERE "workshop_mods"."workshop_id" = $1  [["workshop_id", 3]]
SELECT "workshop_mods".* FROM "workshop_mods" WHERE "workshop_mods"."workshop_id" = $1 ORDER BY "workshop_mods"."position" ASC  [["workshop_id", 3]]

            <% end %>
            <% if workshop_mod.position == @workshop.workshop_mods.count %>
---
SELECT COUNT(*) FROM "workshop_mods" WHERE "workshop_mods"."workshop_id" = $1  [["workshop_id", 3]]