app/views/workshops/index.html.erb

SELECT "categories".* FROM "categories"
SELECT "workshops".* FROM "workshops"
---
      <div id="checkbox">
        <%= collection_check_boxes(:workshop, :category_ids, Category.all, :id, :title) do |b| %>

SELECT "workshops".* FROM "workshops" ORDER BY "workshops"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "categories".* FROM "categories" INNER JOIN "workshop_categories" ON "categories"."id" = "workshop_categories"."category_id" WHERE "workshop_categories"."workshop_id" = $1 ORDER BY "categories"."id" ASC LIMIT $2  [["workshop_id", 1], ["LIMIT", 1]]
---
    <% category_array.each do |category| %>
      <p class='workshop-index-list-category-title'><%= category.first.title %></p>
      <% @workshops.joins(:workshop_categories).where(workshop_categories: {category_id: category.first.id}).each do |workshop| %>