app/views/workshops/new.html.erb

            <%= f.input :title, placeholder:'Upselling' %>
            <%= f.input :categories, collection: Category.where(company_id:current_user.company_id), as: :check_boxes %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."company_id" = $1  [["company_id", 1]]

              <div id='checkbox3' style=" display:flex;justify-content:space-between;flex-direction:column;">
                <%= collection_check_boxes(:workshop, :mod_ids, Mod.where(company_id: current_user.company_id), :id, :title) do |b| %>
---
SELECT "mods".* FROM "mods" WHERE "mods"."company_id" = $1  [["company_id", 1]]