app/views/workshops/new.html.erb

    <div id='checkbox' style=" display:flex;justify-content:space-between;flex-direction:column;">
      <%= collection_check_boxes(:workshop, :category_ids, Category.all, :id, :title) do |b| %>
---
SELECT "categories".* FROM "categories"