app/views/mods/_library.html.erb

SELECT "mods".* FROM "mods" WHERE "mods"."company_id" = $1  [["company_id", 1]]
---
        <div id='checkbox3' style=" display:flex;justify-content:space-between;flex-direction:column;">
          <%= collection_check_boxes(:workshop, :mod_ids, Mod.where(company_id: current_user.company_id), :id, :title) do |b| %>