app/views/program_categories/_new.html.erb

  <div class="modal-body" id="modalNewBookinBody" style='display:flex;flex-direction:column;align-items:center;'>
    <% if Category.where(company_id:current_user.company_id).present? %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."company_id" = $1  [["company_id", 3]]

        <div id='checkbox2' style=" display:flex;justify-content:space-between;flex-direction:column;">
          <%= collection_check_boxes(:training_program, :category_ids, Category.where(company_id: current_user.company_id).order(title: :asc), :id, :title) do |b| %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."company_id" = $1 ORDER BY "categories"."title" ASC  [["company_id", 3]]