app/views/users/_new.html.erb

      <% if current_user.access_level == 'Super Admin' %>
        <%= f.input :company, collection: Company.all, include_blank: false, label: 'Company:' %>
---
SELECT "companies".* FROM "companies"

        <% TagCategory.where(company_id: current_user.company_id).each do |category| %>
          <% if category.tags.present? %>
---
SELECT "tags".* FROM "tags" INNER JOIN "user_tags" ON "tags"."id" = "user_tags"."tag_id" WHERE "user_tags"."user_id" = $1  [["user_id", 330]]