app/views/users/new.html.erb

SELECT "companies".* FROM "companies"
---
    <% if current_user.access_level == 'Super Admin' %>
      <%= f.association :company, collection: Company.all, include_blank: false, label: 'Company' %>