app/views/shared/_left_navbar.html.erb

      <div class="left-navbar-middle-view-mode">
        <% @workshop.mods.order(position: :asc).each do |mod| %>
---
SELECT "mods".* FROM "mods" INNER JOIN "workshop_mods" ON "mods"."id" = "workshop_mods"."mod_id" WHERE "workshop_mods"."workshop_id" = $1 ORDER BY "position" ASC  [["workshop_id", 2]]