app/views/shared/_notifications.html.erb

SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = $1  [["user_id", 1]]
---
<% Notification.where(user_id: current_user.id).each do |notification| %>