app/views/requests/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
              <div class="request-index-type-address">
                <p><%= "#{request.user.firstname} #{request.user.lastname}" %></p>