app/views/pages/_catalogue_workshops.html.erb

SELECT "workshops".* FROM "workshops" WHERE "workshops"."company_id" = $1 ORDER BY "workshops"."title" ASC  [["company_id", 3]]
SELECT "categories".* FROM "categories" WHERE "categories"."company_id" = $1 ORDER BY "categories"."title" ASC  [["company_id", 1]]
---
                </label>
                <%= collection_check_boxes(:workshop, :category_ids, Category.where(company_id: current_user.company_id).order(title: :asc), :id, :title) do |b| %>

SELECT "categories".* FROM "categories" INNER JOIN "workshop_categories" ON "categories"."id" = "workshop_categories"."category_id" WHERE "workshop_categories"."workshop_id" = $1 ORDER BY "categories"."id" ASC LIMIT $2  [["workshop_id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "categories" INNER JOIN "workshop_categories" ON "categories"."id" = "workshop_categories"."category_id" WHERE "workshop_categories"."workshop_id" = $1  [["workshop_id", 2]]
---
          <div class="catalogue-index-info">
            <% if workshop&.categories.count > 1 %>
              <p data-toggle="tooltip" title='<%= "#{workshop.categories.map(&:title).join(', ')}" %>'><%= workshop&.categories.first&.title %> +</p>
            <% else %>
              <p><%= workshop&.categories.first&.title %></p>