app/views/pages/_catalogue_programs.html.erb

                </label>
                <%= collection_check_boxes(:training_program, :category_ids, Category.where(company_id: current_user.company_id).order(title: :asc), :id, :title) do |b| %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."company_id" = $1 ORDER BY "categories"."title" ASC  [["company_id", 1]]