app/views/pages/_catalogue_workshops.html.erb

                </div>
                <%= collection_check_boxes(:workshop, :category_ids, Category.where(company_id: current_user.company_id).order(title: :asc), :id, :title) do |b| %>
---
SELECT "workshops".* FROM "workshops" WHERE "workshops"."company_id" = $1 ORDER BY "workshops"."title" ASC  [["company_id", 3]]