app/views/pages/_dashboard_personal.html.erb

SELECT "training_workshops".* FROM "training_workshops" INNER JOIN "workshops" ON "workshops"."id" = "training_workshops"."workshop_id" WHERE "training_workshops"."training_id" IS NULL AND "workshops"."company_id" = $1 AND "training_workshops"."date" IS NOT NULL AND NOT (date < '2021-04-14')  [["company_id", 1]]
SELECT COUNT(*) FROM "training_workshops" INNER JOIN "attendees" ON "attendees"."training_workshop_id" = "training_workshops"."id" WHERE "training_workshops"."company_id" = $1 AND "attendees"."user_id" = $2 AND (date > '2021-04-14')  [["company_id", 1], ["user_id", 1]]
---
      <div class='dashboard-label'>
        <h3><strong><%= TrainingWorkshop.joins(:attendees).where(company_id: current_user.company_id, attendees: {user_id: current_user.id}).where('date > ?', Date.today).count %></strong></h3>

SELECT COUNT(*) FROM "training_workshops" INNER JOIN "attendees" ON "attendees"."training_workshop_id" = "training_workshops"."id" WHERE "training_workshops"."company_id" = $1 AND "attendees"."user_id" = $2 AND (date <= '2021-04-14') AND ("training_workshops"."available_date" IS NULL OR (available_date > '2021-04-14'))  [["company_id", 1], ["user_id", 1]]
---
      <div class='dashboard-label'>
        <h3><strong><%= TrainingWorkshop.joins(:attendees).where(company_id: current_user.company_id, attendees: {user_id: current_user.id}).where('date <= ?', Date.today).where(available_date: nil).or(TrainingWorkshop.joins(:attendees).where(company_id: current_user.company_id, attendees: {user_id: current_user.id}).where('date <= ?', Date.today).where('available_date > ?', Date.today)).count %></strong></h3>

SELECT COUNT(*) FROM "training_workshops" INNER JOIN "attendees" ON "attendees"."training_workshop_id" = "training_workshops"."id" WHERE "training_workshops"."company_id" = $1 AND "attendees"."user_id" = $2 AND "attendees"."status" = $3  [["company_id", 1], ["user_id", 1], ["status", "Completed"]]
---
      <div class='dashboard-label'>
        <h3><strong><%= TrainingWorkshop.joins(:attendees).where(company_id: current_user.company_id, attendees: {user_id: current_user.id, status: 'Completed'}).count %></strong></h3>

SELECT "training_workshops".* FROM "training_workshops" INNER JOIN "attendees" ON "attendees"."training_workshop_id" = "training_workshops"."id" WHERE "attendees"."user_id" = $1 AND "attendees"."status" = $2 AND NOT (date < '2021-04-14')  [["user_id", 1], ["status", "Registered"]]
SELECT "trainings".* FROM "trainings" INNER JOIN "training_workshops" ON "training_workshops"."training_id" = "trainings"."id" INNER JOIN "attendees" ON "attendees"."training_workshop_id" = "training_workshops"."id" WHERE "attendees"."user_id" = $1 AND "attendees"."status" = $2 AND NOT (date < '2021-04-14')  [["user_id", 1], ["status", "Registered"]]
---
          <div class='training-index-card'>
            <% if element.training_workshops.joins(:attendees).where(attendees: {user_id: current_user.id, status: 'Invited'}).empty? %>