app/views/pages/_dashboard_all.html.erb

SELECT "training_workshops".* FROM "training_workshops" WHERE "training_workshops"."company_id" = $1 AND "training_workshops"."date" = $2  [["company_id", 1], ["date", "2021-04-14"]]
SELECT COUNT(*) FROM "training_workshops" WHERE "training_workshops"."company_id" = $1 AND (date > '2021-04-14')  [["company_id", 1]]
---
      <div class='dashboard-label'>
        <h3><strong><%= TrainingWorkshop.where(company_id: current_user.company_id).where('date > ?', Date.today).count %></strong></h3>

SELECT COUNT(*) FROM "training_workshops" WHERE "training_workshops"."company_id" = $1 AND (date < '2021-04-14')  [["company_id", 1]]
SELECT "training_workshops".* FROM "training_workshops" WHERE "training_workshops"."company_id" = $1 AND "training_workshops"."workshop_type" = $2 AND (date <= '2021-04-14') AND (available_date > '2021-04-14')  [["company_id", 1], ["workshop_type", "Asynchronous"]]
---
      <div class='dashboard-label'>
        <h3><strong><%= (TrainingWorkshop.where(company_id: current_user.company_id, workshop_type: 'Asynchronous').where('date <= ?', Date.today).where('available_date > ?', Date.today) + TrainingWorkshop.where(company_id: current_user.company_id).where(date: Date.today)).count %></strong></h3>

SELECT "training_workshops".* FROM "training_workshops" WHERE "training_workshops"."company_id" = $1  [["company_id", 1]]
SELECT "trainings".* FROM "trainings" WHERE "trainings"."company_id" = $1  [["company_id", 1]]
---
    <h3 class='training-index-list-dashboard-title'>Trainings Overview</h3>
    <% ((Training.where(company_id: current_user.company_id) + TrainingWorkshop.where(company_id: current_user.company_id)).sort_by(&:date)).each do |element| %>