app/views/pages/organisation.html.erb

            </div>
            <%= f.input :tag, label: false, collection: Tag.where(tag_category_id: category.id).map(&:tag_name), as: :check_boxes, input_html: { class: "tag-selector" }, required: false, checked: tag_checked, legend_tag: false %>
---
SELECT "tags".* FROM "tags" WHERE "tags"."tag_category_id" = $1  [["tag_category_id", 1]]

      </div>
      <% TagCategory.where(company_id: current_user.company_id).order(name: :asc).each do |category| %>
---
SELECT "tag_categories".* FROM "tag_categories" WHERE "tag_categories"."company_id" = $1 ORDER BY "tag_categories"."name" ASC  [["company_id", 3]]

              <% tags = '' %>
              <% user.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "user_tags" ON "tags"."id" = "user_tags"."tag_id" WHERE "user_tags"."user_id" = $1  [["user_id", 183]]