app/views/program_workshops/_new.html.erb

      <div id='checkbox' style=" display:flex;justify-content:space-between;flex-direction:column;">
        <% Category.all.each do |category| %>
          <% unless category.workshops.empty?  %>
            <p><%= category.title %></p>
            <%= collection_check_boxes(:training_program, :workshop_ids, Workshop.joins(:workshop_categories).where(workshop_categories: {category_id: category.id} ), :id, :title) do |b| %>
---
SELECT "categories".* FROM "categories"
SELECT "workshops".* FROM "workshops" INNER JOIN "workshop_categories" ON "workshop_categories"."workshop_id" = "workshops"."id" WHERE "workshop_categories"."category_id" = $1  [["category_id", 1]]
SELECT 1 AS one FROM "workshops" INNER JOIN "workshop_categories" ON "workshops"."id" = "workshop_categories"."workshop_id" WHERE "workshop_categories"."category_id" = $1 LIMIT $2  [["category_id", 1], ["LIMIT", 1]]
SELECT "workshops".* FROM "workshops" INNER JOIN "workshop_categories" ON "workshop_categories"."workshop_id" = "workshops"."id" WHERE "workshop_categories"."category_id" = $1  [["category_id", 2]]