app/views/tags/_new.html.erb

  </div>
  <% if TagCategory.where(company_id: current_user.company_id).present? %>
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]