app/views/workshop_categories/_new.html.erb

SELECT "categories".* FROM "categories"
---
      <div id='checkbox2' style=" display:flex;justify-content:space-between;flex-direction:column;">
        <%= collection_check_boxes(:workshop, :category_ids, Category.all, :id, :title) do |b| %>