app/views/training_workshops/_new.html.erb

SELECT "categories".* FROM "categories"
SELECT "workshops".* FROM "workshops" INNER JOIN "workshop_categories" ON "workshop_categories"."workshop_id" = "workshops"."id" WHERE "workshop_categories"."category_id" = $1  [["category_id", 2]]
SELECT 1 AS one FROM "workshops" INNER JOIN "workshop_categories" ON "workshops"."id" = "workshop_categories"."workshop_id" WHERE "workshop_categories"."category_id" = $1 LIMIT $2  [["category_id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" INNER JOIN "workshop_categories" ON "categories"."id" = "workshop_categories"."category_id" WHERE "workshop_categories"."workshop_id" = $1 ORDER BY "categories"."id" ASC LIMIT $2  [["workshop_id", 2], ["LIMIT", 1]]
---
      <div id='checkbox' style=" display:flex;justify-content:space-between;flex-direction:column;">
        <% Category.all.each do |category| %>
          <% unless category.workshops.empty?  %>
            <p><%= category.title %></p>
            <%= collection_check_boxes(:training, :workshop_ids, Workshop.joins(:workshop_categories).where(workshop_categories: {category_id: category.id} ), :id, :title) do |b| %>