app/views/training_workshops/show.html.erb

      <h3><%= "#{@training_workshop.date.strftime('%d/%m/%Y')} From #{@training_workshop.starts_at.strftime('%H:%M')} to #{@training_workshop.ends_at.strftime('%H:%M')}" %></h3>
    <% elsif @training_workshop.workshop.workshop_type == 'Synchronous' && @training_workshop.available_date.present? %>
---
SELECT "workshops".* FROM "workshops" WHERE "workshops"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]