app/views/workshop_skills/_new.html.erb

SELECT "skill_groups".* FROM "skill_groups"
SELECT "skills".* FROM "skills" WHERE "skills"."skill_group_id" = $1  [["skill_group_id", 1]]
---
      <div id='checkbox' style=" display:flex;justify-content:space-between;flex-direction:column;">
        <% SkillGroup.all.each do |group| %>
          <p><%= group.title %></p>
          <%= collection_check_boxes(:workshop, :skill_ids, Skill.where(skill_group_id: group.id), :id, :title) do |b| %>