app/controllers/attendees_controller.rb

  def create
    @attendee = Attendee.new(training_workshop_id: params[:training_workshop_id], user_id: params[:user_id], status: 'Confirmed')
    authorize @attendee
    if @attendee.save
---
INSERT INTO "attendees" ("user_id", "training_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["training_id", 1], ["created_at", "2020-01-20 11:18:14.834029"], ["updated_at", "2020-01-20 11:18:14.834029"]]

  def create_all
    training = Training.find(params[:training_id])
---
SELECT "trainings".* FROM "trainings" WHERE "trainings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]