app/controllers/categories_controller.rb

INSERT INTO "categories" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Team Management"], ["description", "Jouer en équipe."], ["created_at", "2020-01-09 16:51:43.572132"], ["updated_at", "2020-01-09 16:51:43.572132"]]
---
  def create
    @category = Category.new(category_params)
    authorize @category
    @category.company_id = current_user.company_id
    @category.title = 'Sans titre' if @category.title == ''
    @page = params[:category][:page]
    if @category.save

UPDATE "categories" SET "description" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["description", "blablabla en slip"], ["updated_at", "2020-01-09 16:49:06.109537"], ["id", 2]]
INSERT INTO "categories" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Team Management"], ["description", "Jouer en équipe."], ["created_at", "2020-01-09 16:51:43.572132"], ["updated_at", "2020-01-09 16:51:43.572132"]]
---
  def update
    authorize @category
    @category.update(category_params)
    if @category.save