app/controllers/companies_controller.rb

  def create
    @company = Company.new(company_params)
    authorize @company
    if @company.save
---
INSERT INTO "companies" ("name", "address", "zipcode", "city", "logo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    authorize @company
    @company.update(company_params)
---
UPDATE "companies" SET "zipcode" = $1, "updated_at" = $2 WHERE "companies"."id" = $3  [["zipcode", "75020"], ["updated_at", "2020-01-08 14:42:55.378600"], ["id", 1]]