app/controllers/mods_controller.rb

SELECT "workshops".* FROM "workshops" WHERE "workshops"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def new
    @module = Mod.new
    authorize @module
    if params[:workshop_id].present?
      @workshop = Workshop.find(params[:workshop_id])

INSERT INTO "mods" ("title", "duration", "company_id", "created_at", "updated_at", "media") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Notre premier module"], ["duration", 5], ["company_id", 1], ["created_at", "2021-04-14 15:35:35.146842"], ["updated_at", "2021-04-14 15:35:35.146842"], ["media", ""]]
SELECT "workshops".* FROM "workshops" WHERE "workshops"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "workshop_mods" ("position", "mod_id", "workshop_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["position", 1], ["mod_id", 1], ["workshop_id", 3], ["created_at", "2021-04-14 15:35:35.161837"], ["updated_at", "2021-04-14 15:35:35.161837"]]
SELECT COUNT(*) FROM "workshop_mods" WHERE "workshop_mods"."workshop_id" = $1  [["workshop_id", 3]]
INSERT INTO "workshop_mods" ("mod_id", "workshop_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["mod_id", 2], ["workshop_id", 24], ["created_at", "2021-04-15 16:15:07.333821"], ["updated_at", "2021-04-15 16:15:07.333821"]]
---
  def create
    @module = Mod.new(mod_params)
    authorize @module
    @module.document = params[:mod][:document]&.gsub(/edit/, 'present')
    @module.company_id = current_user.company_id
    if @module.save
      if params[:workshop_id].present?
        workshop = Workshop.find(params[:workshop_id])
        WorkshopMod.create(mod_id: @module.id, workshop_id: workshop.id, position: WorkshopMod.where(workshop_id: params[:workshop_id]).count + 1)
        redirect_to workshop_path(workshop)
      elsif params[:training_workshop_id].present?
        training_workshop = TrainingWorkshop.find(params[:training_workshop_id])
        TrainingWorkshopMod.create(mod_id: @module.id, training_workshop_id: training_workshop.id, position: TrainingWorkshopMod.where(training_workshop_id: params[:training_workshop_id]).count + 1)

SELECT "workshops".* FROM "workshops" WHERE "workshops"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
INSERT INTO "mods" ("title", "duration", "created_at", "updated_at", "media") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "mod test 2"], ["duration", 45], ["created_at", "2021-04-15 16:27:20.614306"], ["updated_at", "2021-04-15 16:27:20.614306"], ["media", ""]]
---
  def update
    authorize @module
    workshop = Workshop.find(params[:workshop_id]) if params[:workshop_id].present?
    @module.update(mod_params)
    if @module.save

SELECT "mods".* FROM "mods" WHERE "mods"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_mod
    @module = Mod.find(params[:id])