app/controllers/mods_controller.rb

SELECT "mods".* FROM "mods" WHERE "mods"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def create
    @new_mod = Mod.new(mod_params)
    authorize @new_mod
    @new_mod.company_id = current_user.company_id
    content_id = params.dig(:mod, :content_id)

    if content_id.present?
      @content = Content.find(content_id)
    else
      @content = Workshop.find(params.dig(:mod, :workshop_id))
    end

    target_position = params.dig(:mod, :position).to_i + 1
    mods = @content.mods.order(position: :asc)

    @new_mod.workshop_id = @content.id
    @new_mod.mod_type = params.dig(:mod, :mod_type)

    i = target_position
    mods.where('position >= ?', target_position).each do |mod|
      mod.update position: i + 1
      i += 1
    end

    @new_mod.position = target_position

    @new_mod.save
    @content.update(duration: @content.mods.map(&:duration).sum)