app/controllers/pages_controller.rb

SELECT "trainings".* FROM "trainings" WHERE "trainings"."company_id" = $1  [["company_id", 1]]
SELECT "trainings".* FROM "trainings" INNER JOIN "attendees" ON "attendees"."training_id" = "trainings"."id" INNER JOIN "training_workshops" ON "training_workshops"."training_id" = "trainings"."id" WHERE "attendees"."user_id" = $1 AND (training_workshops.date < '2020-01-26') AND (training_workshops.date >= '2020-01-20')  [["user_id", 1]]
SELECT "trainings".* FROM "trainings" WHERE "trainings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def dashboard
    complete_profile_path

    @trainings = Training.where(company: current_user.company)
    @employees_form = User.where(company: current_user.company)
    @types_form = ["Synchronous", "Asynchronous"]

    @recommendations = UserInterest.where(user_id: current_user.id)

    unless current_user.hr_or_above?
      @trainings = @trainings.joins(sessions: :attendees).where(attendees: { user_id: current_user.id }).distinct
      @recommendations = @recommendations.where(user_id: current_user.id)
    end

    # SEARCH TRAININGS
    if params[:search_trainings].present?
      unless params[:search_trainings][:title].blank?
        @trainings = @trainings.search_trainings("#{params[:search_trainings][:title]}")
      end
      unless params[:training][:categories].reject{|c| c.empty?}.blank?
        @trainings = @trainings.joins(folder: :folder_categories).where(folder_categories: {category_id: params[:training][:categories].reject{|c| c.empty?}.map{|x| x.to_i}}) + @trainings.joins(sessions: {workshop: {content: :content_categories}}).where(content_categories: {category_id: params[:training][:categories].reject{|c| c.empty?}.map{|x| x.to_i}})
        @trainings = Training.where(id: @trainings.map{|x| x.id})

SELECT "trainings".* FROM "trainings" INNER JOIN "attendees" ON "attendees"."training_id" = "trainings"."id" WHERE "attendees"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 11]]
---
      if current_user.hr_or_above?
        unless params[:search_trainings][:employee].blank?
          selected_employee = User.search_by_name("#{params[:search_trainings][:employee]}").first
          @trainings = @trainings.joins(sessions: :attendees).where(attendees: { user_id: selected_employee.id }).distinct

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      end
      if current_user.hr_or_above?
        unless params[:search_recommendations][:employee].blank?
          selected_employee = User.find(params[:search_recommendations][:employee])