app/controllers/pages_controller.rb

SELECT "training_workshops".* FROM "training_workshops" INNER JOIN "trainings" ON "trainings"."id" = "training_workshops"."training_id" INNER JOIN "attendees" ON "attendees"."training_id" = "trainings"."id" WHERE "attendees"."user_id" = $1 AND (date < '2020-01-26') AND (date >= '2020-01-20')  [["user_id", 1]]
---
  def dashboard
    @my_trainings = Training.joins(:attendees).where(attendees: {user_id: current_user.id})
    @my_workshops = TrainingWorkshop.joins(training: :attendees).where(attendees: {user_id: current_user.id})