app/controllers/pages_controller.rb

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def dashboard
    complete_profile
    @my_past_sessions = (Session.includes([:content]).joins(:attendees).where(available_date: nil, attendees: {user_id: current_user.id}).where('date < ?', Date.today) + Session.joins(:attendees).where(attendees: {user_id: current_user.id}).where.not(available_date: nil).where('available_date < ?', Date.today)).uniq.sort_by{|x| x.date}
    @my_current_sessions = (Session.includes([:content]).joins(:attendees).where(attendees: {user_id: current_user.id}).where('date >= ?', Date.today).order(date: :asc) + Session.joins(:attendees).where(attendees: {user_id: current_user.id}).where.not(available_date: nil).where('date < ?', Date.today).where('available_date >= ?', Date.today)).uniq.sort_by{|x| x.date}
    @all_my_sessions = @my_past_sessions + @my_current_sessions
    @my_recommended_pending = UserInterest.where(user_id: current_user.id, recommendation: 'Pending')
    @my_recommended_answered = UserInterest.where(user_id: current_user.id, recommendation: ['Yes', 'No'])
    if ['Super Admin', 'Account Owner', 'HR'].include?(current_user.access_level)
      @past_sessions = (Session.includes([:content]).where(available_date: nil, company_id: current_user.company_id).where('date < ?', Date.today) + Session.where(company_id: current_user.company_id).where.not(available_date: nil).where('available_date < ?', Date.today)).uniq.sort_by{|x| x.date}

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def overview
    @contents = Content.where(company_id: current_user.company_id)
    @start_date = Date.today.beginning_of_year
    @end_date = Date.today
    if params[:search].present?
      @contents = @contents.where("unaccent(lower(title)) LIKE ?", "%#{I18n.transliterate(params[:search][:title].downcase)}%")

SELECT "users".* FROM "users" WHERE "users"."company_id" = $1 ORDER BY lastname ASC  [["company_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" WHERE 1=0
SELECT "tags".* FROM "tags" INNER JOIN "user_tags" ON "tags"."id" = "user_tags"."tag_id" WHERE "user_tags"."user_id" = $1  [["user_id", 6]]
SELECT "users".* FROM "users" INNER JOIN "user_tags" ON "user_tags"."user_id" = "users"."id" WHERE "users"."company_id" = $1 AND "user_tags"."tag_id" = $2  [["company_id", 1], ["tag_id", 2]]
SELECT "tags".* FROM "tags" WHERE "tags"."tag_category_id" = $1  [["tag_category_id", 2]]
---
  def organisation
    if params[:csv].present?
      params[:csv][:selected_users].present? ? @users = User.where(id: params[:csv][:selected_users].split(',')).order(lastname: :asc).uniq : @users = User.where(company_id: current_user.company_id)
      attributes = []
      params[:csv].each do |key, value|
        if !['selected_users', 'cost', 'trainings'].include?(key) && value == '1'
          attributes << key
        end
      end
      cost = params[:csv][:cost]
      trainings = params[:csv][:trainings]
    else
      cost, trainings = false, false
      # Index with 'search' option and global visibility for SEVEN Users
      index_function(User.where(company_id: current_user.company_id))
      @tags = Tag.joins(:company).where(companies: {id: current_user.company_id})
      @tag_categories = TagCategory.includes([:tags]).where(company_id: current_user.company_id).order(position: :asc)
      if params[:add_tags].present?
        @selected_users = User.where(id: params[:add_tags][:users].split(','))
        tags = Tag.where(id: params[:tag][:id].reject(&:blank?))
        @selected_users.each do |user|
          tags.each do |tag|
            current = UserTag.where(user_id: user.id, tag_category_id: tag.tag_category_id).first
            if current.present?