app/controllers/program_workshops_controller.rb

  def create
    @program_workshop = ProgramWorkshop.new
    authorize @program_workshop
    @training_program = TrainingProgram.find(params[:training_program_id])
    # Select all Workshops whose checkbox is checked and create a ProgramWorkshop
    array = params[:training_program][:workshop_ids].uniq.drop(1).map(&:to_i)
    array.each do |ind|
      if ProgramWorkshop.where(training_program_id: @training_program.id, workshop_id: ind).empty?
        ProgramWorkshop.create(training_program_id: @training_program.id, workshop_id: ind)
      end
    end
    # Select all Workshops whose checkbox is unchecked and destroy their ProgramWorkshop, if existing
    (Workshop.ids - array).each do |ind|
      unless ProgramWorkshop.where(training_program_id: @training_program.id, workshop_id: ind).empty?
        ProgramWorkshop.where(training_program_id: @training_program.id, workshop_id: ind).first.destroy
---
SELECT "training_programs".* FROM "training_programs" WHERE "training_programs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "program_workshops".* FROM "program_workshops" WHERE "program_workshops"."training_program_id" = $1 AND "program_workshops"."workshop_id" = $2 ORDER BY "program_workshops"."id" ASC LIMIT $3  [["training_program_id", 1], ["workshop_id", 1], ["LIMIT", 1]]
SELECT "workshops".* FROM "workshops" WHERE "workshops"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT 1 AS one FROM "program_workshops" WHERE "program_workshops"."training_program_id" = $1 AND "program_workshops"."workshop_id" = $2 LIMIT $3  [["training_program_id", 1], ["workshop_id", 3], ["LIMIT", 1]]
INSERT INTO "program_workshops" ("training_program_id", "workshop_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["training_program_id", 1], ["workshop_id", 3], ["created_at", "2020-01-17 11:01:04.272332"], ["updated_at", "2020-01-17 11:01:04.272332"]]
SELECT 1 AS one FROM "program_workshops" WHERE "program_workshops"."training_program_id" = $1 AND "program_workshops"."workshop_id" = $2 LIMIT $3  [["training_program_id", 1], ["workshop_id", 1], ["LIMIT", 1]]
DELETE FROM "program_workshops" WHERE "program_workshops"."id" = $1  [["id", 1]]