app/controllers/program_categories_controller.rb

  def create
    @training_program = TrainingProgram.find(params[:training_program_id])
    @program_category = ProgramCategory.new
    authorize @program_category
    # Links TrainingProgram to Categories through joined table
    array = params[:training_program][:category_ids].drop(1).map(&:to_i)
    array.each do |ind|
      if ProgramCategory.where(training_program_id: @training_program.id, category_id: ind).empty?
        ProgramCategory.create(training_program_id: @training_program.id, category_id: ind)
      end
    end
    # Select all Categories whose checkbox is unchecked and destroy their ProgramCategory, if existing
    (Category.ids - array).each do |ind|
      unless ProgramCategory.where(training_program_id: @training_program.id, category_id: ind).empty?
        ProgramCategory.where(training_program_id: @training_program.id, category_id: ind).first.destroy
---
SELECT "training_programs".* FROM "training_programs" WHERE "training_programs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "program_categories".* FROM "program_categories" WHERE "program_categories"."training_program_id" = $1 AND "program_categories"."category_id" = $2 ORDER BY "program_categories"."id" ASC LIMIT $3  [["training_program_id", 2], ["category_id", 3], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT 1 AS one FROM "program_categories" WHERE "program_categories"."training_program_id" = $1 AND "program_categories"."category_id" = $2 LIMIT $3  [["training_program_id", 2], ["category_id", 3], ["LIMIT", 1]]
INSERT INTO "program_categories" ("training_program_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["training_program_id", 2], ["category_id", 3], ["created_at", "2021-04-16 13:26:11.720385"], ["updated_at", "2021-04-16 13:26:11.720385"]]
SELECT "categories"."id" FROM "categories"
SELECT 1 AS one FROM "program_categories" WHERE "program_categories"."training_program_id" = $1 AND "program_categories"."category_id" = $2 LIMIT $3  [["training_program_id", 2], ["category_id", 1], ["LIMIT", 1]]
DELETE FROM "program_categories" WHERE "program_categories"."id" = $1  [["id", 1]]