app/controllers/skills_controller.rb

  def create
    @skill = Skill.new(skill_params)
    authorize @skill
    @skill.save ? (redirect_to skill_path(@skill)) : (render :new)
---
INSERT INTO "skills" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Cuisiner"], ["description", "Faire des pâtes."], ["created_at", "2020-01-10 09:01:54.626717"], ["updated_at", "2020-01-10 09:01:54.626717"]]

  def update
    authorize @skill
    @skill.update(skill_params)
---
UPDATE "skills" SET "description" = $1, "updated_at" = $2 WHERE "skills"."id" = $3  [["description", "Faire des saucisses."], ["updated_at", "2020-01-10 09:02:56.746876"], ["id", 1]]

  def set_skill
    @skill = Skill.find(params[:id])
---
SELECT "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]