app/controllers/trainings_controller.rb

  def show
    @training = Training.find(params[:id])
    authorize @training

    # TEMP (Since Training contains only one Workshop)
    @workshop = @training.workshops.first
    @workshop_completed =
      Attendee.where(user: current_user, session: @workshop.sessions.ids).map(&:status).uniq.join == 'Completed' ?
---
SELECT "workshops".* FROM "workshops" INNER JOIN "training_workshops" ON "workshops"."id" = "training_workshops"."workshop_id" WHERE "training_workshops"."training_id" = $1  [["training_id", 3]]
SELECT "attendees".* FROM "attendees" WHERE "attendees"."training_id" = $1 AND "attendees"."user_id" = $2 ORDER BY "attendees"."id" ASC LIMIT $3  [["training_id", 1], ["user_id", 1], ["LIMIT", 1]]