app/controllers/training_workshops_controller.rb

SELECT "workshops".* FROM "workshops" WHERE "workshops"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "training_workshops".* FROM "training_workshops" WHERE "training_workshops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @training_workshop = TrainingWorkshop.find(params[:id])

SELECT "workshops".* FROM "workshops" WHERE "workshops"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def view_mode
    authorize @training_workshop
    @workshop = Workshop.find(@training_workshop.workshop_id)

SELECT "trainings".* FROM "trainings" WHERE "trainings"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "workshops".* FROM "workshops" WHERE "workshops"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT 1 AS one FROM "training_workshops" WHERE "training_workshops"."training_id" = $1 AND "training_workshops"."workshop_id" = $2 LIMIT $3  [["training_id", 3], ["workshop_id", 2], ["LIMIT", 1]]
SELECT "training_workshops".* FROM "training_workshops" WHERE "training_workshops"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "workshops".* FROM "workshops" WHERE "workshops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "training_workshops" ("title", "date", "training_id", "workshop_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Trust Challenge 2"], ["date", "2020-01-20"], ["training_id", 1], ["workshop_id", 1], ["created_at", "2020-01-20 10:35:11.133743"], ["updated_at", "2020-01-20 10:35:11.133743"]]
UPDATE "training_workshops" SET "date" = $1, "start_time" = $2, "end_time" = $3, "updated_at" = $4 WHERE "training_workshops"."id" = $5  [["date", "2020-01-20"], ["start_time", "09:00:00"], ["end_time", "17:00:00"], ["updated_at", "2020-01-20 09:25:29.112417"], ["id", 1]]
SELECT "workshops"."id" FROM "workshops"
SELECT "trainings".* FROM "trainings" WHERE "trainings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "training_workshops".* FROM "training_workshops" WHERE "training_workshops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "training_workshops" WHERE "training_workshops"."id" = $1  [["id", 2]]
---
  def create
    @training_workshop = TrainingWorkshop.new
    authorize @training_workshop
    @training = Training.find(params[:training_id])
    # Select all Workshops whose checkbox is checked and create a TrainingWorkshop
    array = params[:training][:workshop_ids].uniq.drop(1).map(&:to_i)
    array.each do |ind|
      workshop = Workshop.find(ind)
      if TrainingWorkshop.where(workshop_id: ind).empty?
        new_training_workshop = TrainingWorkshop.create(workshop.attributes.except("id", "created_at", "updated_at"))
        new_training_workshop.update(training_id: @training.id, workshop_id: ind)
      end
    end
    # Select all Workshops whose checkbox is unchecked and destroy their TrainingWorkshop, if existing
    (Workshop.ids - array).each do |ind|
      unless TrainingWorkshop.where(training_id: @training.id, workshop_id: ind).empty?
        TrainingWorkshop.where(training_id: @training.id, workshop_id: ind).first.destroy

SELECT "training_workshops".* FROM "training_workshops" WHERE "training_workshops"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "workshops".* FROM "workshops" WHERE "workshops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "training_workshops" SET "date" = $1, "start_time" = $2, "end_time" = $3, "updated_at" = $4 WHERE "training_workshops"."id" = $5  [["date", "2020-01-20"], ["start_time", "09:00:00"], ["end_time", "17:00:00"], ["updated_at", "2020-01-20 09:25:29.112417"], ["id", 1]]
---
  def update
    @training_workshop = TrainingWorkshop.find(params[:id])
    authorize @training_workshop
    @training_workshop.update(training_workshop_params)

SELECT "training_workshops".* FROM "training_workshops" WHERE "training_workshops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "workshops".* FROM "workshops" WHERE "workshops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "training_workshops" ("title", "date", "training_id", "workshop_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Trust Challenge 2"], ["date", "2020-01-21"], ["training_id", 1], ["workshop_id", 1], ["created_at", "2020-01-20 10:25:44.094673"], ["updated_at", "2020-01-20 10:25:44.094673"]]
UPDATE "training_workshops" SET "updated_at" = $1 WHERE "training_workshops"."id" = $2  [["updated_at", "2021-04-19 13:54:05.758150"], ["id", 1]]
---
  def copy
    @training_workshop = TrainingWorkshop.find(params[:id])
    authorize @training_workshop
    new_training_workshop = TrainingWorkshop.new(@training_workshop.attributes.except("id", "created_at", "updated_at"))
    new_training_workshop.title = params[:copy][:title]
    new_training_workshop.date = params[:copy][:date]
    redirect_to training_path(@training_workshop.training) if new_training_workshop.save

SELECT "workshops".* FROM "workshops" WHERE "workshops"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "training_workshops" ("title", "duration", "workshop_type", "image", "company_id", "date", "starts_at", "ends_at", "workshop_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def book_training_workshop
    workshop = Workshop.find(params[:workshop_id])
    @training_workshop = TrainingWorkshop.new(workshop.attributes.except("id", "created_at", "updated_at", "author_id"))
    @training_workshop.workshop_id = params[:workshop_id]
    authorize @training_workshop
    @training_workshop.update(training_workshop_params)
    if @training_workshop.end_date_after_start_date && @training_workshop.save

SELECT "training_workshops".* FROM "training_workshops" WHERE "training_workshops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_training_workshop
    @training_workshop = TrainingWorkshop.find(params[:id])