app/controllers/training_workshops_controller.rb

  def create
    @training_workshop = TrainingWorkshop.new
    authorize @training_workshop
    @training = Training.find(params[:training_id])
    # Select all Workshops whose checkbox is checked and create a TrainingWorkshop
    array = params[:training][:workshop_ids].uniq.drop(1).map(&:to_i)
    array.each do |ind|
      if TrainingWorkshop.where(training_id: @training.id, workshop_id: ind).empty?
        TrainingWorkshop.create(title: @training.title, training_id: @training.id, workshop_id: ind)
      end
    end
    # Select all Workshops whose checkbox is unchecked and destroy their TrainingWorkshop, if existing
    (Workshop.ids - array).each do |ind|
      unless TrainingWorkshop.where(training_id: @training.id, workshop_id: ind).empty?
        TrainingWorkshop.where(training_id: @training.id, workshop_id: ind).first.destroy
---
SELECT 1 AS one FROM "training_workshops" WHERE "training_workshops"."training_id" = $1 AND "training_workshops"."workshop_id" = $2 LIMIT $3  [["training_id", 3], ["workshop_id", 1], ["LIMIT", 1]]
INSERT INTO "training_workshops" ("training_id", "workshop_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["training_id", 3], ["workshop_id", 2], ["created_at", "2020-01-20 08:57:12.213947"], ["updated_at", "2020-01-20 08:57:12.213947"]]
SELECT "workshops"."id" FROM "workshops"
DELETE FROM "training_workshops" WHERE "training_workshops"."id" = $1  [["id", 2]]