app/controllers/trainings_controller.rb

SELECT "trainings".* FROM "trainings" INNER JOIN "companies" ON "companies"."id" = "trainings"."company_id" WHERE (lower(companies.name) LIKE '%seven%')
SELECT "trainings".* FROM "trainings" WHERE (lower(title) LIKE '%blob%') ORDER BY "trainings"."title" ASC
---
  def index
    # Index with 'search' option and global visibility for SEVEN Users
    if current_user.access_level == 'Super Admin'
      @trainings = policy_scope(Training)
      if params[:search]
        @trainings = ((Training.where("lower(title) LIKE ?", "%#{params[:search][:title].downcase}%").order(title: :asc)) + (Training.joins(:company).where("lower(companies.name) LIKE ?", "%#{params[:search][:title].downcase}%"))).flatten(1).uniq
      end
    # Index for other Users, with visibility limited to programs proposed by their company only
    else
      @trainings = policy_scope(Training)
      @trainings = Training.where(company: current_user.company.id)
      if params[:search]
        @trainings = @training.where("lower(title) LIKE ?", "%#{params[:search][:title].downcase}%").order(title: :asc)

SELECT "training_programs".* FROM "training_programs" WHERE "training_programs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "trainings" ("title", "description", "image", "participant_number", "training_program_id", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT "training_programs".* FROM "training_programs" ORDER BY "training_programs"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "program_workshops".* FROM "program_workshops" WHERE "program_workshops"."training_program_id" = $1  [["training_program_id", 1]]
SELECT "trainings".* FROM "trainings" WHERE "trainings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "training_workshops" ("title", "training_id", "workshop_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Trust Challenge"], ["training_id", 1], ["workshop_id", 1], ["created_at", "2020-01-20 10:42:27.549301"], ["updated_at", "2020-01-20 10:42:27.549301"]]
---
  def create
    @training_program = TrainingProgram.find(params[:training_program_id])
    @training = Training.new(title: params[:training][:title], description: @training_program.description, participant_number: params[:training][:participant_number].to_i, image: @training_program.image, training_program_id: @training_program.id, company_id: current_user.company.id)
    authorize @training
    if @training.save
      @training_program.program_workshops.each do |program_workshop|
        TrainingWorkshop.create(title: program_workshop.workshop.title, training_id: @training.id, workshop_id: program_workshop.workshop.id)

UPDATE "trainings" SET "image" = $1, "start_date" = $2, "end_date" = $3, "updated_at" = $4 WHERE "trainings"."id" = $5
---
  def update
    authorize @training
    @training.update(training_params)

SELECT "trainings".* FROM "trainings" WHERE "trainings"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def set_training
    @training = Training.find(params[:id])