app/controllers/training_programs_controller.rb

  def index
    # Index with 'search' option and global visibility for SEVEN Users
    if current_user.access_level == 'Super Admin'
      @training_programs = policy_scope(TrainingProgram)
      if params[:search]
        @training_programs = ((TrainingProgram.where("lower(title) LIKE ?", "%#{params[:search][:title].downcase}%").order(title: :asc)) + (TrainingProgram.joins(:company).where("lower(companies.name) LIKE ?", "%#{params[:search][:title].downcase}%"))).flatten(1).uniq
      end
    # Index for other Users, with visibility limited to programs proposed by their company only
    else
      @training_programs = policy_scope(TrainingProgram)
      @training_programs = TrainingProgram.joins(:company).where(companies: { name: current_user.company.name })
      if params[:search]
        @training_programs = @training_programs.where("lower(title) LIKE ?", "%#{params[:search][:title].downcase}%").order(title: :asc)
---
SELECT "training_programs".* FROM "training_programs" INNER JOIN "companies" ON "companies"."id" = "training_programs"."company_id" WHERE (lower(companies.name) LIKE '%blob%')
SELECT "training_programs".* FROM "training_programs" WHERE (lower(title) LIKE '%blob%') ORDER BY "training_programs"."title" ASC

  def create
    @training_program = TrainingProgram.new(training_program_params)
    authorize @training_program
    @training_program.company_id = current_user.company.id
    @training_program.author_id = current_user.id
    if @training_program.save
---
INSERT INTO "training_programs" ("title", "description", "participant_number", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Program test"], ["description", "blob"], ["participant_number", 2], ["company_id", 1], ["created_at", "2020-01-16 15:44:11.963254"], ["updated_at", "2020-01-16 15:44:11.963254"]]

  def update
    authorize @training_program
    @training_program.update(training_program_params)
    if @training_program.save
---
UPDATE "training_programs" SET "image" = $1, "updated_at" = $2 WHERE "training_programs"."id" = $3
INSERT INTO "training_programs" ("title", "description", "participant_number", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Program test"], ["description", "blob"], ["participant_number", 2], ["company_id", 1], ["created_at", "2020-01-16 15:34:40.379442"], ["updated_at", "2020-01-16 15:34:40.379442"]]

  def set_training_program
    @training_program = TrainingProgram.find(params[:id])
---
SELECT "training_programs".* FROM "training_programs" WHERE "training_programs"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]