app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.picture = 'https://i0.wp.com/rouelibrenmaine.fr/wp-content/uploads/2018/10/empty-avatar.png' if @user.picture == ''
    @user.company_id = current_user.company_id
    authorize @user
    tags = params[:user][:tags].reject{|x| x.empty?}.map{|c| c.to_i} if params[:user][:tags].present?
    if @user.save
      if tags.present?
        tags.each do |tag|
          UserTag.create(user_id: @user.id, tag_id: tag)
---
INSERT INTO "users" ("email", "encrypted_password", "firstname", "lastname", "access_level", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"