app/controllers/users_controller.rb

SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "bob@focal.com"], ["LIMIT", 1]]
SELECT "companies".* FROM "companies"
INSERT INTO "users" ("email", "encrypted_password", "firstname", "lastname", "access_level", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.find_by(email: params.dig(:user, :email).strip.downcase).presence || User.new(user_params)
    authorize @user

    if @user.id.present?
      @user.update company_id: current_user.company_id if @user.company_id.nil?
    else
      @user.lastname = @user.lastname.upcase
      @user.firstname = @user.firstname.capitalize
      @user.picture = 'https://i0.wp.com/rouelibrenmaine.fr/wp-content/uploads/2018/10/empty-avatar.png' if @user.picture == ''
      @user.company_id = current_user.company_id
      @user.authentication_token = Base64.encode64(@user.email).gsub("\n", "") + SecureRandom.hex(32)

      new_user = User.find_by(email: params.dig(:user, :email)).nil?
      send_invite = params.dig(:user, :send_invite) == 'true'

      # Send invitation
      if new_user
        if send_invite
          @user.save(validate: false)

SELECT "users".* FROM "users" WHERE (lower(firstname) LIKE '%test%')
---
  def unlink_from_company
    selected_users_ids = params[:selected_users].split(',')
    selected_users = User.where(id: selected_users_ids)
    authorize selected_users

    selected_users.each do |user|