app/controllers/workshop_categories_controller.rb

  def create
    @workshop = Workshop.find(params[:workshop_id])
    @workshop_category = WorkshopCategory.new
    authorize @workshop_category
    # Links Workshop to Categories through joined table
    array = params[:workshop][:category_ids].drop(1).map(&:to_i)
    array.each do |ind|
      if WorkshopCategory.where(workshop_id: @workshop.id, category_id: ind).empty?
        WorkshopCategory.create(workshop_id: @workshop.id, category_id: ind)
      end
    end
    # Select all Categories whose checkbox is unchecked and destroy their WorkshopCategory, if existing
    (Category.ids - array).each do |ind|
      unless WorkshopCategory.where(workshop_id: @workshop.id, category_id: ind).empty?
        WorkshopCategory.where(workshop_id: @workshop.id, category_id: ind).first.destroy
---
SELECT "workshops".* FROM "workshops" WHERE "workshops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "workshop_categories".* FROM "workshop_categories" WHERE "workshop_categories"."workshop_id" = $1 AND "workshop_categories"."category_id" = $2 ORDER BY "workshop_categories"."id" ASC LIMIT $3  [["workshop_id", 1], ["category_id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT 1 AS one FROM "workshop_categories" WHERE "workshop_categories"."workshop_id" = $1 AND "workshop_categories"."category_id" = $2 LIMIT $3  [["workshop_id", 1], ["category_id", 1], ["LIMIT", 1]]
INSERT INTO "workshop_categories" ("workshop_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["workshop_id", 1], ["category_id", 2], ["created_at", "2020-01-20 14:29:35.055546"], ["updated_at", "2020-01-20 14:29:35.055546"]]
SELECT "categories"."id" FROM "categories"
SELECT 1 AS one FROM "workshop_categories" WHERE "workshop_categories"."workshop_id" = $1 AND "workshop_categories"."category_id" = $2 LIMIT $3  [["workshop_id", 1], ["category_id", 2], ["LIMIT", 1]]
DELETE FROM "workshop_categories" WHERE "workshop_categories"."id" = $1  [["id", 1]]