app/controllers/workshops_controller.rb

  def create_workshop
    @new_workshop = Workshop.new(title: params[:new_workshop][:title], description: params[:new_workshop][:description], company_id: current_user.company_id, author_id: current_user.id)
    skip_authorization
    if @new_workshop.save
---
INSERT INTO "workshops" ("title", "company_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Workshop test"], ["company_id", 1], ["author_id", 1], ["created_at", "2021-04-14 15:33:48.307815"], ["updated_at", "2021-04-14 15:33:48.307815"]]

  def update_workshop
    skip_authorization
    @workshop.update(title: params[:new_workshop][:title], description: params[:new_workshop][:description])
    if @workshop.save
      params[:new_workshop][:categories].reject!(&:empty?).each do |category_id|
        unless WorkshopCategory.where(workshop_id: @workshop.id, category_id: category_id.to_i).present?
          WorkshopCategory.create(workshop_id: @workshop.id, category_id: category_id.to_i)
        end
      end
      to_destroy = Category.where(company_id: current_user.company_id).map(&:id) - params[:new_workshop][:categories].map{|x| x.to_i}
      WorkshopCategory.where(workshop_id: @workshop.id, category_id: to_destroy).destroy_all
---
UPDATE "workshops" SET "title" = $1, "updated_at" = $2 WHERE "workshops"."id" = $3  [["title", "test 2bis"], ["updated_at", "2021-04-15 14:29:03.162641"], ["id", 12]]
SELECT "workshop_categories".* FROM "workshop_categories" WHERE "workshop_categories"."workshop_id" = $1 AND "workshop_categories"."category_id" = $2  [["workshop_id", 11], ["category_id", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "workshop_categories" ("workshop_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["workshop_id", 11], ["category_id", 1], ["created_at", "2021-04-15 14:24:43.930538"], ["updated_at", "2021-04-15 14:24:43.930538"]]
SELECT "categories".* FROM "categories" WHERE "categories"."company_id" = $1  [["company_id", 1]]
DELETE FROM "workshops" WHERE "workshops"."id" = $1  [["id", 3]]
DELETE FROM "workshop_categories" WHERE "workshop_categories"."id" = $1  [["id", 9]]
SELECT "workshop_categories".* FROM "workshop_categories" WHERE "workshop_categories"."workshop_id" = $1 AND "workshop_categories"."category_id" = $2  [["workshop_id", 12], ["category_id", 1]]

  def change_author
    skip_authorization
    if params[:ajax].present?
      @workshop = Workshop.find(params[:workshop_id])
---
SELECT "workshops".* FROM "workshops" WHERE "workshops"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def book
    @workshop = Workshop.find(params[:id])
---
SELECT "workshops".* FROM "workshops" WHERE "workshops"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]