app/controllers/workshops_controller.rb

  def index
    # Index with 'search' option and global visibility for SEVEN Users
    if current_user.access_level == 'Super Admin'
      @workshops = policy_scope(Workshop)
      if params[:search]
        @workshops = ((Workshop.where("lower(title) LIKE ?", "%#{params[:search][:title].downcase}%").order(title: :asc)) + (Workshop.joins(:company).where("lower(companies.name) LIKE ?", "%#{params[:search][:title].downcase}%"))).flatten(1).uniq
      elsif params[:filter]
        @workshops = Workshop.joins(:workshop_categories).where(workshop_categories: {category_id: params[:filter].map(&:to_i)})
      end
    # Index for other Users, with visibility limited to programs proposed by their company only
    else
      @workshops = policy_scope(Workshop)
      @workshops = Workshop.where(company_id: current_user.company.id)
      if params[:search]
        @workshops = @workshops.where("lower(title) LIKE ?", "%#{params[:search][:title].downcase}%").order(title: :asc)
---
SELECT "categories".* FROM "categories" INNER JOIN "workshop_categories" ON "categories"."id" = "workshop_categories"."category_id" WHERE "workshop_categories"."workshop_id" = $1 ORDER BY "categories"."id" ASC LIMIT $2  [["workshop_id", 1], ["LIMIT", 1]]
SELECT "workshops".* FROM "workshops" INNER JOIN "workshop_categories" ON "workshop_categories"."workshop_id" = "workshops"."id" WHERE "workshop_categories"."category_id" IN ($1, $2) AND "workshop_categories"."category_id" = $3  [["category_id", 1], ["category_id", 2], ["category_id", 1]]
SELECT "workshops".* FROM "workshops" INNER JOIN "companies" ON "companies"."id" = "workshops"."company_id" WHERE (lower(companies.name) LIKE '%trust%')
SELECT "workshops".* FROM "workshops" WHERE (lower(title) LIKE '%trust%') ORDER BY "workshops"."title" ASC

  def create
    @workshop = Workshop.new(workshop_params)
    authorize @workshop
    @workshop.company_id = current_user.company.id
    if @workshop.save

      # Links Workshop to Categories through joined table
      array = params[:workshop][:category_ids].drop(1).map(&:to_i)
      array.each do |ind|
        if WorkshopCategory.where(workshop_id: @workshop.id, category_id: ind).empty?
          WorkshopCategory.create(workshop_id: @workshop.id, category_id: ind)
        end
      end
      # Select all Categories whose checkbox is unchecked and destroy their WorkshopCategory, if existing
      (Category.ids - array).each do |ind|
        unless WorkshopCategory.where(workshop_id: @workshop.id, category_id: ind).empty?
---
INSERT INTO "workshops" ("title", "duration", "description", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Workshop Test"], ["duration", 15], ["description", "blob"], ["company_id", 1], ["created_at", "2020-01-16 16:25:07.512012"], ["updated_at", "2020-01-16 16:25:07.512012"]]
SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "workshop_categories" WHERE "workshop_categories"."workshop_id" = $1 AND "workshop_categories"."category_id" = $2 LIMIT $3  [["workshop_id", 3], ["category_id", 2], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "workshops".* FROM "workshops" WHERE "workshops"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "workshop_categories" ("workshop_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["workshop_id", 3], ["category_id", 2], ["created_at", "2020-01-16 16:25:07.539668"], ["updated_at", "2020-01-16 16:25:07.539668"]]
SELECT "categories"."id" FROM "categories"
SELECT "workshops".* FROM "workshops" WHERE "workshops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "workshop_categories" WHERE "workshop_categories"."workshop_id" = $1 AND "workshop_categories"."category_id" = $2 LIMIT $3  [["workshop_id", 3], ["category_id", 1], ["LIMIT", 1]]

  def update
    authorize @workshop
    @workshop.update(workshop_params)
    if @workshop.save
---
UPDATE "workshops" SET "content" = $1, "updated_at" = $2 WHERE "workshops"."id" = $3  [["content", "<p><span style=\"color:#e74c3c;\"><u>Test.</u></span></p>\r\n"], ["updated_at", "2020-01-15 15:29:27.439947"], ["id", 1]]
INSERT INTO "workshops" ("title", "company_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Workshop test"], ["company_id", 1], ["author_id", 1], ["created_at", "2021-04-14 15:33:48.307815"], ["updated_at", "2021-04-14 15:33:48.307815"]]
UPDATE "workshops" SET "updated_at" = $1 WHERE "workshops"."id" = $2  [["updated_at", "2021-04-14 15:12:21.927847"], ["id", 3]]

  def destroy
    @workshop.destroy
---
DELETE FROM "workshops" WHERE "workshops"."id" = $1  [["id", 3]]

  def set_workshop
    @workshop = Workshop.find(params[:id])
---
SELECT "workshops".* FROM "workshops" WHERE "workshops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]