app/controllers/workshop_skills_controller.rb

SELECT "workshops".* FROM "workshops" WHERE "workshops"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "workshop_skills".* FROM "workshop_skills" WHERE "workshop_skills"."workshop_id" = $1 AND "workshop_skills"."skill_id" = $2 ORDER BY "workshop_skills"."id" ASC LIMIT $3  [["workshop_id", 1], ["skill_id", 1], ["LIMIT", 1]]
SELECT "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "workshop_skills" WHERE "workshop_skills"."workshop_id" = $1 AND "workshop_skills"."skill_id" = $2 LIMIT $3  [["workshop_id", 1], ["skill_id", 1], ["LIMIT", 1]]
INSERT INTO "workshop_skills" ("skill_id", "workshop_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["skill_id", 1], ["workshop_id", 1], ["created_at", "2020-01-16 11:03:54.834676"], ["updated_at", "2020-01-16 11:03:54.834676"]]
SELECT "skills"."id" FROM "skills"
SELECT 1 AS one FROM "workshop_skills" WHERE "workshop_skills"."workshop_id" = $1 AND "workshop_skills"."skill_id" = $2 LIMIT $3  [["workshop_id", 1], ["skill_id", 2], ["LIMIT", 1]]
DELETE FROM "workshop_skills" WHERE "workshop_skills"."id" = $1  [["id", 1]]
---
  def create
    @workshop_skill = WorkshopSkill.new
    authorize @workshop_skill
    @workshop = Workshop.find(params[:workshop_id])
    # Select all Users whose checkbox is checked and create a WorkshopSkill
    array = params[:workshop][:skill_ids].drop(1).map(&:to_i)
    array.each do |ind|
      if WorkshopSkill.where(workshop_id: @workshop.id, skill_id: ind).empty?
        WorkshopSkill.create(workshop_id: @workshop.id, skill_id: ind)
      end
    end
    # Select all Skills whose checkbox is unchecked and destroy their WorkshopSkill, if existing
    (Skill.ids - array).each do |ind|
      unless WorkshopSkill.where(workshop_id: @workshop.id, skill_id: ind).empty?
        WorkshopSkill.where(workshop_id: @workshop.id, skill_id: ind).first.destroy