app/views/categories/_index.html.erb

    <h3 style='color: #F26419;'>Existing Themes</h3>
    <% Category.where(company_id: current_user.company_id).order(title: :asc).each do |theme| %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."company_id" = $1 ORDER BY "categories"."title" ASC  [["company_id", 1]]