app/views/training_programs/index.html.erb

      <div id="checkbox">
        <%= collection_check_boxes(:workshop, :category_ids, Category.all, :id, :title) do |b| %>
---
SELECT "categories".* FROM "categories"