app/views/training_programs/show.html.erb

        <div>
          <% if @training_program.workshops.present? %>
            <p><%= "#{@training_program.workshops.count} Workshops" %></p>
            <% duration = 0 %>
            <% @training_program.workshops.each do |workshop| %>
---
SELECT "workshops".* FROM "workshops" INNER JOIN "program_workshops" ON "workshops"."id" = "program_workshops"."workshop_id" WHERE "program_workshops"."training_program_id" = $1  [["training_program_id", 1]]
SELECT COUNT(*) FROM "workshops" INNER JOIN "program_workshops" ON "workshops"."id" = "program_workshops"."workshop_id" WHERE "program_workshops"."training_program_id" = $1  [["training_program_id", 1]]
SELECT "workshops".* FROM "workshops" INNER JOIN "program_workshops" ON "workshops"."id" = "program_workshops"."workshop_id" WHERE "program_workshops"."training_program_id" = $1  [["training_program_id", 4]]